Documents/УДАЛИТЬ_Невыходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_Невыходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Замеры</xr:Item>
				<xr:Item>InformationRegister.Невыходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаПродаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бригада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_Невыходы/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
	КонецЕсли;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//проверим пересечение дат
	Для каждого ЭлементТЧ из Объект.Сотрудники Цикл
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ЭлементТЧ.Сотрудник));
		Если НайденныеСтроки.Количество() > 1 Тогда
			НачалоПериода = Дата(Год(ЭлементТЧ.ДатаНачала), Месяц(ЭлементТЧ.ДатаНачала), День(ЭлементТЧ.ДатаНачала),
					Час(ЭлементТЧ.ВремяНачала), Минута(ЭлементТЧ.ВремяНачала), Секунда(ЭлементТЧ.ВремяНачала));
			КонецПериода = Дата(Год(ЭлементТЧ.ДатаОкончания), Месяц(ЭлементТЧ.ДатаОкончания), День(ЭлементТЧ.ДатаОкончания),
					Час(ЭлементТЧ.ВремяОкончания), Минута(ЭлементТЧ.ВремяОкончания), Секунда(ЭлементТЧ.ВремяОкончания));
			Для каждого ЭлементМассива из НайденныеСтроки Цикл
				Если ЭлементТЧ.НомерСтроки <> ЭлементМассива.НомерСтроки Тогда
					НачалоПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаНачала), Месяц(ЭлементМассива.ДатаНачала), День(ЭлементМассива.ДатаНачала),
							Час(ЭлементМассива.ВремяНачала), Минута(ЭлементМассива.ВремяНачала), Секунда(ЭлементМассива.ВремяНачала));
					КонецПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаОкончания), Месяц(ЭлементМассива.ДатаОкончания), День(ЭлементМассива.ДатаОкончания),
							Час(ЭлементМассива.ВремяОкончания), Минута(ЭлементМассива.ВремяОкончания), Секунда(ЭлементМассива.ВремяОкончания));
					Если НачалоПериодаЭлемента >= НачалоПериода И КонецПериодаЭлемента <= КонецПериода Тогда
						Сообщить("Сотрудники: данные в строках " + ЭлементТЧ.НомерСтроки + " и " + ЭлементМассива.НомерСтроки + " противоречат друг другу");
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;  
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЭлементТЧ из Объект.Бригады Цикл
		НайденныеСтроки = Объект.Бригады.НайтиСтроки(Новый Структура("Бригада", ЭлементТЧ.Бригада));
		Если НайденныеСтроки.Количество() > 1 Тогда
			НачалоПериода = Дата(Год(ЭлементТЧ.ДатаНачала), Месяц(ЭлементТЧ.ДатаНачала), День(ЭлементТЧ.ДатаНачала),
					Час(ЭлементТЧ.ВремяНачала), Минута(ЭлементТЧ.ВремяНачала), Секунда(ЭлементТЧ.ВремяНачала));
			КонецПериода = Дата(Год(ЭлементТЧ.ДатаОкончания), Месяц(ЭлементТЧ.ДатаОкончания), День(ЭлементТЧ.ДатаОкончания),
					Час(ЭлементТЧ.ВремяОкончания), Минута(ЭлементТЧ.ВремяОкончания), Секунда(ЭлементТЧ.ВремяОкончания));
			Для каждого ЭлементМассива из НайденныеСтроки Цикл
				Если ЭлементТЧ.НомерСтроки <> ЭлементМассива.НомерСтроки Тогда
					НачалоПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаНачала), Месяц(ЭлементМассива.ДатаНачала), День(ЭлементМассива.ДатаНачала),
							Час(ЭлементМассива.ВремяНачала), Минута(ЭлементМассива.ВремяНачала), Секунда(ЭлементМассива.ВремяНачала));
					КонецПериодаЭлемента = Дата(Год(ЭлементМассива.ДатаОкончания), Месяц(ЭлементМассива.ДатаОкончания), День(ЭлементМассива.ДатаОкончания),
							Час(ЭлементМассива.ВремяОкончания), Минута(ЭлементМассива.ВремяОкончания), Секунда(ЭлементМассива.ВремяОкончания));
					Если НачалоПериодаЭлемента >= НачалоПериода И КонецПериодаЭлемента <= КонецПериода Тогда
						Сообщить("Бригады: данные в строках " + ЭлементТЧ.НомерСтроки + " и " + ЭлементМассива.НомерСтроки + " противоречат друг другу");
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;  
		КонецЕсли;
	КонецЦикла;
	
	// меньше/больше
	Для Каждого ЭлементТЧ Из Объект.Сотрудники Цикл
		Если ЭлементТЧ.ДатаОкончания < ЭлементТЧ.ДатаНачала Тогда
			Сообщить("Сотрудники: в строке " + ЭлементТЧ.НомерСтроки + " дата окончания невыхода меньше даты начала");
			Отказ = Истина;			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементТЧ Из Объект.Бригады Цикл
		Если ЭлементТЧ.ДатаОкончания < ЭлементТЧ.ДатаНачала Тогда
			Сообщить("Бригады: в строке " + ЭлементТЧ.НомерСтроки + " дата окончания невыхода меньше даты начала");
			Отказ = Истина;			
			Возврат;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.Невыходы.Форма.ФормаПодбора" Тогда		
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура СотрудникиДатаНачалаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные.ВремяНачала = Дата(1,1,1) Тогда
		ТекущиеДанные.ВремяНачала = Дата(1,1,1,8,0,0);
	КонецЕсли;
	Если ТекущиеДанные.ДатаОкончания = Дата(1,1,1) Тогда
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиДатаОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные.ВремяОкончания = Дата(1,1,1) Тогда
		ТекущиеДанные.ВремяОкончания = Дата(1,1,1,23,59,59);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоСотрудникам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Назначение", "Сотрудники");
	
	ОткрытьФорму("Документ.Невыходы.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Назначение", "Бригады");
	
	ОткрытьФорму("Документ.Невыходы.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		
КонецПроцедуры

Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
КонецПроцедуры	

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.ТаблицаПодбора);
	Назначение = ВыбранноеЗначение.Назначение;
	СписокСотрудниковБригад = ВыбранноеЗначение.Список;
	
	Если Назначение = "Сотрудники" Тогда
		Для каждого ЭлементСписка из СписокСотрудниковБригад Цикл			
			Для каждого СтрокаТаблицы Из ТаблицаПодбора Цикл
					
				НоваяСтрока = Объект.Сотрудники.Добавить();
				НоваяСтрока.Сотрудник 		= ЭлементСписка.Значение;
				НоваяСтрока.ДатаНачала 		= СтрокаТаблицы.ДатаС; 
				НоваяСтрока.ДатаОкончания 	= СтрокаТаблицы.ДатаПо;
				НоваяСтрока.ВремяНачала 	= СтрокаТаблицы.ВремяС;
				НоваяСтрока.ВремяОкончания  = СтрокаТаблицы.ВремяПо;
				
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли Назначение = "Бригады" Тогда
		Для каждого ЭлементСписка из СписокСотрудниковБригад Цикл			
			Для каждого СтрокаТаблицы Из ТаблицаПодбора Цикл
					
				НоваяСтрока = Объект.Бригады.Добавить();
				НоваяСтрока.Бригада 		= ЭлементСписка.Значение;
				НоваяСтрока.ДатаНачала 		= СтрокаТаблицы.ДатаС; 
				НоваяСтрока.ДатаОкончания 	= СтрокаТаблицы.ДатаПо;
				НоваяСтрока.ВремяНачала 	= СтрокаТаблицы.ВремяС;
				НоваяСтрока.ВремяОкончания  = СтрокаТаблицы.ВремяПо;
				
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры
